import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
        //Практическое задание 1
        //1 задание Напишите программу, где я складываю сумму двух целостных чисел a и b?

//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        System.out.println(a + b);

        //2 задание Напишите программу, в которой я запрашиваю имя, фамилию, возраст, страну, и в
        // конце программа выводит данные пользователя в консоль.
//            Scanner in = new Scanner(System.in);
//        System.out.println("Напишите свое имя");
//        String a = in.next();
//        System.out.println("Напишите свою фамилию");
//        String b = in.next();
//        System.out.println("Напишите свой возраст");
//        int g = in.nextInt();
//        System.out.println("Напишите свою страну");
//        String h = in.next();
//        System.out.println("Имя: " + a + "\n" + "Фамилия: " + b + "\n" + "Возраст: " + g + "\n" + "Страна: " + h);

        //3 задание - Напишите программу, в которой я ввожу два целостных числа, и если первое число больше второго,
        // то программа выведет true, иначе false.
//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        boolean f = a > b;
//        System.out.println(f);

        //4 задание - Напишите программу, в которой я ввожу три целостных числа a, b и c.
        // Выведите сумму, умножение и разницу всех этих чисел.

//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        int c = in.nextInt();
//        System.out.println(a + b + c);
//        System.out.println(a * b * c);
//        System.out.println(a - b - c);

        //5 задание Выполните данную математическую операцию, где я ввожу a, b и c с консоли.
        // Выполните данную операцию: a3 + 2b2 – 3ab + c3
        //*Подсказка: Вы можете использовать метод Math.pow(). Пример: Math.pow(3,2) = 9.
//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        int c = in.nextInt();
//        System.out.println((Math.pow(a,3)) + (2 * (Math.pow(b,2))) - (3 * (a * b)) + (Math.pow(c,3)));

        //6 задание - Напишите программу, которая запрашивает два числа a и b. Найдите гипотенузу треугольника
        // с заданными катетами.
        //*Подсказка: Вы можете использовать метод Math.sqrt().
//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        System.out.println(Math.sqrt(a) + Math.sqrt(b));

        //7 задание -  n школьников делят k яблок поровну, неделящийся остаток остается в корзинке.
        // Сколько яблок достанется каждому школьнику?
//        Scanner in = new Scanner(System.in);
//        int n = in.nextInt();
//        int k = in.nextInt();
//        int c = k % n;
//        System.out.println((k - c) / n);

        //8 задание - n школьников делят k яблок поровну, неделящийся остаток остается в корзинке.
        // Сколько яблок останется в корзинке?
        //*Подсказка: Вы можете использовать оператор % который возвращает остаток от деления.
//        Scanner in = new Scanner(System.in);
//        int n = in.nextInt();
//        int k = in.nextInt();
//        System.out.println(k % n);

        //Домашнее задание

        //1 задача Напишите программу, где я складываю сумму двух целостных чисел a = 100 и b = 200?
//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        System.out.println(a + b);

        //2 задание Напишите программу, где я умножаю a и b из консоли.

//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        System.out.println(a * b);

        //3 задание Напишите программу, в которой я запрашиваю университет, факультет, предмет,
        // и в конце программа выводит данные пользователя в консоль.
//        Scanner in = new Scanner(System.in);
//        System.out.println("Введите ваш университет");
//        String a = in.next();
//        System.out.println("Введите ваш факультет");
//        String b = in.next();
//        System.out.println("Введите ваш предмет");
//        String c = in.next();
//        System.out.println("Университет: " + a + "\n" + "Факультет: " + b + "\n" + "Предмет: " + c);

        //4 задание Напишите программу, в которой я ввожу три целостных чисел a, b и c, и если сумма a и b больше c,
        // то программа выведет true, иначе false.

//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
//        int c = in.nextInt();
//        boolean f = (a + b) > c;
//        System.out.println(f);

        //5 задание Выполните данную математическую операцию, где я ввожу x, y и z с консоли.
        // Выполните данную операцию: x4 + 4xy2 – 4yz + z4
//        Scanner in = new Scanner(System.in);
//        int x = in.nextInt();
//        int y = in.nextInt();
//        int z = in.nextInt();
//        System.out.println((Math.pow(x,4)) + (4 * x * (Math.pow(y, 2))) - (4 * y * z) + (Math.pow(z,4)));
    }
}
